Tekla Open API Reference for Tekla Structures 2025
PickerInputThreePoints.ThirdPickedPoint Property
 The third picked point in the view coordinates.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point ThirdPickedPoint { get; set; }
Public Property ThirdPickedPoint As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
PickerInputThreePoints Class
Tekla.Structures.Drawing Namespace